/*int FindSumOfDigits(int num)
{
    int sum = 0;
    while(num>0)
    {
        sum = sum + num % 10; // sum += num%10;
        num = num / 10; // num /=10;
    }
    return sum;
}

int n = 234;
int result = FindSumOfDigits(n);



Console.Writeline($"srgdgv {result}");

*/

//Напишите программу, которая принимает на вход число (А) и выдаёт сумму чисел от 1 до А.
//Напишите программу, которая принимает на вход число N и выдаёт произведение чисел от 1 до N.
//Напишите программу, которая принимает на вход число и выдаёт кол-во цифр в числе.
/*
void Count(int a)
{
    int counter = 0;
    while (a > 0)
    {
        a = a / 10;
        counter = counter+1;
    }
    Console.WriteLine("Count of digits in your number is: " + counter);
}
int a = Convert.ToInt32(Console.Read());
Count(a);
*/

//Напишите программу, которая выводит массив из 8 элементов, заполненный нулями и единицами в случайном порядке.

/*int size = 8;

int[] array = new int[size];

for(int i = 0; i < size; i++)
{
    array[i] = new Random().Next(0, 2);
}

for (int i = 0; i < size; i++)
{
    Console.Write(array[i] + " ");
}*/



